Revit 2026 API
RebarConstraint.GetTargetElement Method
Overload List
Name | Description
GetTargetElement() |  Gets the Element object (either Host or Rebar) which provides the constraint. Will throw exception if it's a multi target constraint.
GetTargetElement(Int32) |  Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
Top
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace